-- https://github.com/annykh/genTech/blob/main/staff.txt

-- 1. Создать новое поле experience_level и заполнить его значением:

	-- 	'Junior', если возраст меньше 25 лет.
	-- 	'Middle', если возраст от 25 до 35 лет.
	-- 	'Senior', если возраст больше 35 лет.

-- 2. Создать новое поле family_status и заполнить его значением:

	-- 'Has children', если has_child равно 'Y'.
	-- 'No children', если has_child равно 'N'.

-- 3. Вывести фамилии всех сотрудников в верхнем регистре.

-- 4. Вывести имена всех сотрудников в нижнем регистре.

-- 5. Создать новое поле fullname и заполнить его объединением имени и фамилии (например, "Anna Daniels").

-- 6. Вычислить длину имени каждого сотрудника и вывести как новое поле firstname_length.

-- 7. Найти сотрудников, у которых длина фамилии больше 6 символов.

-- 8. Создать новое поле child_bonus и заполнить его значением:

	-- 	500, если has_child равно 'Y'.
	-- 	0, если has_child равно 'N'.

-- 9. Вывести возраст всех сотрудников, увеличенный на 5 лет.

-- 10.Создать новое поле salary_category и заполнить его значением:

	-- 	'High', если возраст больше 30 и has_child равно 'Y'.
	-- 	'Medium', если возраст больше 30 и has_child равно 'N'.
	-- 	'Low' для остальных.

-- 11. Найти сотрудников, у которых в фамилии есть символ 's'.

-- 12. Создать новое поле position_rank и заполнить его значением:

	-- 	'Teacher', если должность содержит слово 'Teacher'.
	-- 	'Designer', если должность содержит слово 'Designer'.
	-- 	'Other' для остальных.

-- 13. Найти сотрудников, чьи имена заканчиваются на 'y'.

-- 14. Найти сотрудников, у которых фамилии начинаются с 'A' или 'L'.

-- 15. Создать новое поле username_default и заполнить его значением:

	-- 	username, если имя пользователя указано.
	-- 	'unknown', если имя пользователя не указано.
