-- Создать новую бд gt130824.

-- Активировать бд gt130824.

--  Создать таблицу staff с полями:
-- • id – целое число - первичный ключ с автозаполнением 
-- • firstname - строка максимум 60 символов не null
-- • lastname - строка максимум 100 символов не null
-- • position - строка максимум 100 символов
-- • age - целое число - от 0 до 110(вкл.)
-- • has_child – строка с одним символом - либо Y, либо N
-- • username - строка максимум 100 символов - уникальное значение не null

-- Добавить 3 сотрудников:
-- ('Ally' , 'Austin' , 'Junior UI Designer' , 28 , 'N' , 'ally1' )
-- ('Daniel', 'Faviet', 'Senior UX Designer', 43, 'Y', 'favietD')
-- ('Lily', 'Chen', 'Senior Teacher', 25, 'Y', 'lilychen')

-- Вывести таблицу staff

-- Создать и активировать базу данных tasks.

-- В этой базе создать таблицу employees с полями:
 -- • employee_id – целое число - первичный ключ с автозаполнением 
 -- • first_name - строка максимум 128 символов
 -- • last_name - строка максимум 128 символов
 -- • job - строка максимум 50 символов - не пустое
 -- • age - целое число - больше 18
 -- • has_car – строка только один символ, по умолчанию 'N' 
 -- • user_name - строка максимум 128 символов - уникальное значение, не пустое

-- Добавить 5 строк.

-- Удалить таблицу employees .

-- Удалить бд tasks.
