-- https://github.com/annykh/GT210524-260324/blob/main/db_store_tasks.sql
-- https://github.com/annykh/GT210524-260324/blob/main/%D0%A2%D0%B5%D1%85_%D0%B7%D0%B0%D0%B4%D0%B0%D0%BD%D0%B8%D0%B5.txt

1. Вывести список категорий и товаров, которые относятся к этим категориям.
2. Получить список всех товаров, включённых в заказы, с указанием их цен и категорий.
3. Найти заказы, содержащие товар "Laptop".
4. Вывести даты заказов и имена клиентов, которые их сделали.
5. Вывести названия товаров, которые заказывал клиент с фамилией 'Smith'.
6. Найти имена и фамилии клиентов, которые купили товары из категории "Electronics".
7. Вывести названия товаров и их количество в каждом заказе.
8. Получить список всех товаров, включённых в заказ клиента с email 'john@example.com'.
9. Вывести список всех заказанных товаров с указанием клиентов, которые их заказали.
10. Получить список клиентов, которые заказали "Phone".
11. Получить список всех заказов и их клиентов, отсортированный по дате заказа.
12. Вывести имена клиентов и даты их заказов, где общая сумма заказа превышает 500. Отсортировать по имени клиента.
13. Получить список товаров из категории "Clothing", отсортированных по цене по убыванию. Вывести первые 3 записи.
14. Найти все заказы, содержащие товары категории "Furniture".
15. Получить список всех заказов, где были куплены товары из категории "Clothing".
16. Найти названия и цены товаров, включённых в заказы, стоимостью выше 100, отсортировать по цене. Вывести первые 5 результатов.
17. Вывести названия товаров и их количество из заказов, сделанных клиентами с фамилией 'King', отсортировать по количеству.
18. Получить список всех заказов, содержащих товары из категории "Electronics", с указанием имени клиента, отсортированный по имени клиента. Показать первые 6 записей.
19. Вывести клиентов, заказавших товары стоимостью более 500, с сортировкой по дате заказа по убыванию. Показать первые 5 записей.
20. Получить список товаров из категории "Toys", включённых в заказы, с сортировкой по дате заказа. Показать первые 4 записи.
