https://github.com/annykh/genTech/blob/main/CompanyDB.txt

-- 1. Найдите среднюю зарплату сотрудников в каждом департаменте. Выведите название департамента и среднюю зарплату
-- 2. Определите количество сотрудников в каждом департаменте. Выведите название департамента и количество сотрудников.
-- 3. Найдите минимальную и максимальную зарплаты в каждом департаменте. 
-- Выведите название департамента, минимальную и максимальную зарплату.
-- 4. Определите общую сумму зарплат в каждом департаменте. Выведите название департамента и общую сумму зарплат.
-- 5. Вывести ID департамента с самой высокой средней зарплатой сотрудников.
-- 6. Вывести имя департамента с самой высокой средней зарплатой сотрудников.
-- 7. Выведите имя, фамилию и зарплату сотрудников, чья зарплата выше средней по их департаменту.
-- 8. Найдите проект с наибольшим количеством сотрудников, проработавших на нем больше 100 часов. Вывести ProjectName.
-- 9. Найдите департамент с наименьшим количеством сотрудников. Выведите название департамента и количество сотрудников.
-- 10. Определите департамент с наибольшим суммарным бюджетом проектов, на которых работают его сотрудники.
-- 10.1. Вывести ид департамента, имена и фамилии сотрудников, имена проектов и их бюджет.
-- 10.2. Вывести ид депатамента и сумма бюджета проектов по департаментам.
-- 10.3. Вывести маскимальную сумму бюджета проектов по департаментам.
-- 10.4. Вывести ид депатамента с максимальной суммой бюджета проектов по департаментам.
-- 10.5. Вывести имя депатамента с максимальной суммой бюджета проектов по департаментам.
-- 11. Найдите сотрудников, которые работают в департаменте с самой большой суммарной зарплатой среди всех департаментов.
