// 1. Создать коллекцию employees1.
https://github.com/annykh/GT130824/blob/main/Summary%2018.js

// 2. Полностью заменить документ сотрудника с именем John и фамилией Doe на новый.
// Новый документ:
// Имя: John
// Фамилия: Doe
// Возраст: 29
// Должность: Full Stack Developer
// Зарплата: 3500
// Навыки: ['JavaScript', 'Node.js', 'React']

// 3. Увеличить зарплату на 500 всем сотрудникам старше 30 лет.

// 4. Добавить поле bonus со значением 0 для всех сотрудников.

// 5. Установить значение поля bonus в 100 для сотрудников с зарплатой больше 3000.

// 6. Увеличить зарплату сотрудника Emily Davis на 1000.

// 7. Уменьшить зарплату сотрудника Mike Johnson на 300.

// 8. Добавить поле department со значением IT для сотрудника Jane Smith.

// 9. Удалить поле skills у сотрудника Mike Johnson.

// 10. Удалить поле bonus для всех сотрудников, кроме Jane Smith.

// 11. Добавить поле experience со значением 5 для всех сотрудников старше 30 лет.

// 12. Установить значение поля experience в 2 для сотрудников младше 30 лет.

// 13. Создать новое поле position_level и установить его значение в зависимости от зарплаты:
// Junior — зарплата меньше 2500.
// Middle — зарплата от 2500 до 3500.
// Senior — зарплата больше 3500.

// 14. Добавить новый навык "HTML" для сотрудника с именем "John".

// 15. Добавить сразу два навыка "Scrum" и "Kanban" для сотрудника "Jane".

// 16. Добавить навык "React" для "John" только в том случае, если его еще нет.

// 17. Добавить навык "Agile" для "Jane" на вторую позицию в массиве.

// 18. Удалить последний элемент из массива навыков "Emily".

// 19. Удалить навык "Planning" у "Jane".

// 20. Удалить навыки "Javascript" и "HTML" у "John".
