// 1. Создать коллекцию employees1.
https://github.com/annykh/GT130824/blob/main/Summary%2018.js

// 2. Полностью заменить документ сотрудника с именем John и фамилией Doe на новый.
// Новый документ:
// Имя: John
// Фамилия: Doe
// Возраст: 29
// Должность: Full Stack Developer
// Зарплата: 3500
// Навыки: ['JavaScript', 'Node.js', 'React']

// 3. Увеличить зарплату на 500 всем сотрудникам старше 30 лет.

// 4. Добавить поле bonus со значением 0 для всех сотрудников.

// 5. Установить значение поля bonus в 100 для сотрудников с зарплатой больше 3000.

// 6. Увеличить зарплату сотрудника Emily Davis на 1000.

// 7. Уменьшить зарплату сотрудника Mike Johnson на 300.

// 8. Добавить поле department со значением IT для сотрудника Jane Smith.

// 9. Удалить поле skills у сотрудника Mike Johnson.

// 10. Удалить поле bonus для всех сотрудников, кроме Jane Smith.
