-- https://github.com/annykh/GT130824/blob/main/shop.sql
-- https://github.com/annykh/GT130824/blob/main/%D0%A2%D0%B5%D1%85_%D0%BE%D0%BF%D0%B8%D1%81%D0%B0%D0%BD%D0%B8%D0%B5_shop.txt

1. Определить какие из покупок были совершены марте.
2. Определить какие из покупок были совершены в интервале от 10 апреля 2022 до 10 мая 2022 года.
3. Определить сколько покупок было совершено в июне.
4. Определить среднюю стоимость покупок в марте.
5. Определить какие покупки были совершены во вторник.
6. Определить, сколько покупок было совершено в каждый месяц. Отсортировать строки в порядке возрастания количества покупок. Вывести два поля - номер месяца и количество покупок.
7. Определить, в какой месяц было совершено больше всего покупок.  Вывести два поля - номер месяца и количество покупок.
8. Определить количество заказов, совершенных в выходные дни (суббота и воскресенье).
9. Определить, в какой день недели чаще всего совершаются покупки.
10. Вывести количество заказов, оформленных в первый день месяца.
11. Выведите минимальный рейтинг покупателя среди сделавших заказ в мае 2022 года.
Вывести : min_rating.
12. Выведите продавцов, которые оформили заказ на наибольшую сумму в период с марта по май 2022 года.
Вывести : sell_id, amt
13. Определить продавца, оформившего наибольшее количество заказов в мае 2022 года.
