База данных - https://github.com/annykh/GT130824/blob/main/store.sql
Тех. описание базы - https://github.com/annykh/GT130824/blob/main/%D0%A2%D0%B5%D1%85_%D0%BE%D0%BF%D0%B8%D1%81%D0%B0%D0%BD%D0%B8%D0%B5.txt

1. Вывести список категорий(category_name) и товаров(product_name), которые относятся к этим категориям.
2. Получить список всех товаров(product_name), включённых в заказы, с указанием их цен(price) и категорий(category_name).
3. Найти заказы, содержащие товар "Laptop". Вывести order_id, order_date, first_name, last_name.
4. Вывести даты заказов(order_date) и имена клиентов(first_name, last_name), которые их сделали.
5. Вывести названия товаров(product_name), которые заказывал клиент с фамилией 'Smith'.
6. Найти имена и фамилии клиентов, которые купили товары из категории "Electronics".
7. Вывести названия товаров и их количество(quantity) в каждом заказе.
8. Получить список всех товаров(product_name), включённых в заказ клиента с email 'john@example.com'.
9. Вывести список всех заказанных товаров с указанием клиентов, которые их заказали.
10. Получить список клиентов(first_name, last_name), которые заказали "Phone".
11. Получить список всех заказов и их клиентов, отсортированный по дате заказа. Вывести first_name, last_name, order_date.
12. Вывести имена клиентов и даты их заказов, где общая сумма заказа(total) превышает 500. Отсортировать по имени клиента.
13. Получить список товаров(product_name) из категории "Clothing", отсортированных по цене(price) по убыванию. Вывести первые 2 записи.
14. Найти все заказы, содержащие товары категории "Furniture". Вывести order_id и order_date.
15. Получить список всех заказов, где были куплены товары из категории "Clothing". Вывести order_id и order_date.
16. Найти названия и цены товаров, включённых в заказы, стоимостью выше 100, отсортировать по цене. Вывести первые 3 результата.
17. Вывести названия товаров и их количество из заказов, сделанных клиентами с фамилией 'Doe',  отсортировать по количеству.
18. Получить список всех заказов, содержащих товары из категории "Electronics", с указанием имени клиента, отсортированный по имени клиента. Показать первую запись.
19. Вывести клиентов, заказавших товары стоимостью более 500, с сортировкой по дате заказа по убыванию.
20. Получить список товаров из категории 'Clothing', включённых в заказы, с сортировкой по дате заказа. Показать первые 4 записи.
